{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, null, 768]], "num_parameters": 0}, {"name": "input_1", "id": "input_1", "class_name": "InputLayer", "output_shape": [[null, 35, 768]], "num_parameters": 0}, {"name": "time_distributed_1", "id": "time_distributed_1", "class_name": "TimeDistributed", "output_shape": [null, null, 400], "num_parameters": 1130384}, {"name": "user_encoder", "id": "user_encoder", "class_name": "Functional", "output_shape": [null, 400], "num_parameters": 1690784}, {"name": "dot", "id": "dot", "class_name": "Dot", "output_shape": [null, null], "num_parameters": 0}, {"name": "activation", "id": "activation", "class_name": "Activation", "output_shape": [null, null], "num_parameters": 0}], "edges": [["input_2", "time_distributed_1"], ["input_1", "user_encoder"], ["time_distributed_1", "dot"], ["user_encoder", "dot"], ["dot", "activation"]]}